from marshmallow import Schema, fields
from api.schema.object import ObjectSchema

class MetaDataSchema(ObjectSchema):
    '''
    Метаданные

    В JSON есть несколько видов Метаданных.
    Один из них - поле meta, которое фигурирует в большинстве JSON представлений объектов,
    и содержит информацию об объекте или о выдаче, а также может использоваться в качестве
    ссылки на другой объект. Поле meta представляет собой объект со следующими атрибутами:
    '''


    href = fields.URL()
    '''
    Ссылка на объект
    '''


    metadataHref = fields.URL()
    '''
    Ссылка на метаданные сущности (Другой вид метаданных. Присутствует не во всех сущностях)
    '''


    type = fields.String()
    '''
    Тип объекта
    '''


    mediaType = fields.String(default='application/json')
    '''
    Тип данных, которые приходят в ответ от сервиса, либо отправляются в теле запроса.
    В рамках данного API всегда равен application/json
    '''


    uuidHref = fields.URL()
    '''
    Ссылка на объект на UI. Присутствует не во всех сущностях.
    Может быть использована для получения uuid
    '''


    size = fields.Int()
    '''
    Размер выданного списка
    '''


    limit = fields.Int()
    '''
    Максимальное количество элементов в выданном списке.
    Максимальное количество элементов в списке равно 1000.
    '''


    offset = fields.Int()
    '''
    Отступ в выданном списке
    '''


    nextHref = fields.URL()
    '''
    Ссылка на следующую страницу сущностей.
    '''


    previousHref = fields.URL()
    '''
    Ссылка на предыдущую страницу сущностей.
    '''


class MetaSchema(Schema):
    '''
    Эта схема нужна для обёртки метаданных в ключ "meta"
    '''
    meta = fields.Nested(MetaDataSchema)